TheZeroHz/ESP32CSI_Vision/src/v4l2/ESP32P4_V4l2M2m.cpp
#include "v4l2/ESP32P4_V4l2M2m.h"

#include <stdarg.h>
#include <Arduino.h>
#include <errno.h>
#include <fcntl.h>
#include <stdio.h>
#include <string.h>
#include <sys/ioctl.h>
#include <sys/stat.h>
#include <unistd.h>

#include "cam/ESP32P4_Isp.h"
#include "v4l2/ESP32P4_V4l2.h"

#if ESP32P4_V4L2M2M_HAS_V4L2
#include "esp_vfs.h"
#if __has_include("esp_video_ioctl.h")
#include "esp_video_ioctl.h"
#endif
#if __has_include("esp_video_isp_ioctl.h")
#include "esp_video_isp_ioctl.h"
#endif

#ifndef V4L2_PIX_FMT_H264
#define V4L2_PIX_FMT_H264 v4l2_fourcc('H', '2', '6', '4')
#endif
#ifndef V4L2_BUF_CAP_SUPPORTS_USERPTR
#define V4L2_BUF_CAP_SUPPORTS_USERPTR (1 << 1)
#endif
#ifndef V4L2_BUF_CAP_SUPPORTS_MMAP
#define V4L2_BUF_CAP_SUPPORTS_MMAP (1 << 0)
#endif
#ifndef V4L2_META_FMT_ESP_ISP_STATS
#define V4L2_META_FMT_ESP_ISP_STATS v4l2_fourcc('E', 'S', 'T', 'A')
#endif

struct ESP32P4_V4l2M2m::DevSlot {
  ESP32P4_V4l2M2m *owner = nullptr;
  DevKind kind = DEV_JPEG_ENC;
  const char *path = nullptr;
  bool registered = false;
  uint8_t open_n = 0;

  uint16_t out_w = 640;
  uint16_t out_h = 480;
  uint32_t out_fourcc = V4L2_PIX_FMT_RGB565;
  uint16_t cap_w = 640;
  uint16_t cap_h = 480;
  uint32_t cap_fourcc = V4L2_PIX_FMT_JPEG;

  bool out_streaming = false;
  bool cap_streaming = false;
  bool out_queued = false;
  bool cap_queued = false;
  uint8_t *out_ptr = nullptr;
  size_t out_len = 0;
  uint8_t *cap_ptr = nullptr;
  size_t cap_cap = 0;
  size_t cap_len = 0;
  bool cap_ready = false;
  uint32_t seq = 0;
  int owner_pid = 0;

  uint8_t *scratch = nullptr;
  size_t scratch_cap = 0;
};

struct ESP32P4_V4l2M2mVfs {
  static int open_p(void *ctx, const char *, int, int) {
    auto *d = (ESP32P4_V4l2M2m::DevSlot *)ctx;
    return d && d->owner ? d->owner->devOpen(d->kind) : -1;
  }
  static int close_p(void *ctx, int) {
    auto *d = (ESP32P4_V4l2M2m::DevSlot *)ctx;
    return d && d->owner ? d->owner->devClose(d->kind) : -1;
  }
  static ssize_t read_p(void *ctx, int, void *dst, size_t n) {
    auto *d = (ESP32P4_V4l2M2m::DevSlot *)ctx;
    return d && d->owner ? d->owner->devRead(d->kind, dst, n) : -1;
  }
  static ssize_t write_p(void *ctx, int, const void *src, size_t n) {
    auto *d = (ESP32P4_V4l2M2m::DevSlot *)ctx;
    return d && d->owner ? d->owner->devWrite(d->kind, src, n) : -1;
  }
  static int ioctl_p(void *ctx, int, int cmd, va_list args) {
    auto *d = (ESP32P4_V4l2M2m::DevSlot *)ctx;
    void *arg = va_arg(args, void *);
    return d && d->owner ? d->owner->devIoctl(d->kind, (unsigned long)cmd, arg) : -1;
  }
  static int fstat_p(void *ctx, int, struct stat *st) {
    auto *d = (ESP32P4_V4l2M2m::DevSlot *)ctx;
    return d && d->owner ? d->owner->devFstat(d->kind, st) : -1;
  }
};

static int fail(int err) {
  errno = err;
  return -1;
}

static bool pix_from_fourcc(uint32_t fcc, esp32p4_cam_pixformat_t *out) {
  return ESP32P4_V4l2::fourccToPix(fcc, out);
}

static uint32_t fourcc_for_pix(esp32p4_cam_pixformat_t pix) {
  return ESP32P4_V4l2::pixToFourcc(pix);
}

static size_t frame_bytes(uint32_t fcc, uint16_t w, uint16_t h) {
  esp32p4_cam_pixformat_t pix = ESP32P4_PIXFORMAT_RGB565;
  if (!pix_from_fourcc(fcc, &pix)) return (size_t)w * h * 2;
  return esp32p4_pixformat_fb_bytes(pix, w, h);
}

static const char *dev_card(ESP32P4_V4l2M2m::DevKind k) {
  switch (k) {
    case ESP32P4_V4l2M2m::DEV_JPEG_ENC:
      return "CSI Vision JPEG enc";
    case ESP32P4_V4l2M2m::DEV_H264_ENC:
      return "CSI Vision H264 enc";
    case ESP32P4_V4l2M2m::DEV_JPEG_DEC:
      return "CSI Vision JPEG dec";
    case ESP32P4_V4l2M2m::DEV_ISP:
      return "CSI Vision ISP stats";
    default:
      return "CSI Vision M2M";
  }
}

static uint32_t v4l2_buf_type_for(ESP32P4_V4l2M2m::DevKind k, bool capture) {
  if (k == ESP32P4_V4l2M2m::DEV_ISP) return V4L2_BUF_TYPE_META_CAPTURE;
  return capture ? V4L2_BUF_TYPE_VIDEO_CAPTURE : V4L2_BUF_TYPE_VIDEO_OUTPUT;
}

static bool is_m2m(ESP32P4_V4l2M2m::DevKind k) { return k != ESP32P4_V4l2M2m::DEV_ISP; }

bool ESP32P4_V4l2M2m::begin(const Config &cfg) {
  end();
  _cam = cfg.cam;
  _jpeg = cfg.jpeg;
  _h264 = cfg.h264;
  _isp = cfg.isp ? cfg.isp : (_cam && _cam->isp() ? _cam->isp() : nullptr);

  uint16_t w = _cam ? _cam->width() : (_h264 ? _h264->width() : 640);
  uint16_t h = _cam ? _cam->height() : (_h264 ? _h264->height() : 480);
  if (_jpeg && _cam) {
    w = _cam->width();
    h = _cam->height();
  }

  for (int i = 0; i < DEV_N; i++) {
    _slots[i] = new DevSlot();
    _slots[i]->owner = this;
    _slots[i]->kind = (DevKind)i;
    _slots[i]->out_w = w;
    _slots[i]->out_h = h;
    _slots[i]->cap_w = w;
    _slots[i]->cap_h = h;
    switch ((DevKind)i) {
      case DEV_JPEG_ENC:
        _slots[i]->path = ESP32P4_V4L2_DEV_JPEG_ENC;
        _slots[i]->out_fourcc = V4L2_PIX_FMT_RGB565;
        _slots[i]->cap_fourcc = V4L2_PIX_FMT_JPEG;
        break;
      case DEV_H264_ENC:
        _slots[i]->path = ESP32P4_V4L2_DEV_H264_ENC;
        _slots[i]->out_fourcc = V4L2_PIX_FMT_YUV420;
        _slots[i]->cap_fourcc = V4L2_PIX_FMT_H264;
        break;
      case DEV_JPEG_DEC:
        _slots[i]->path = ESP32P4_V4L2_DEV_JPEG_DEC;
        _slots[i]->out_fourcc = V4L2_PIX_FMT_JPEG;
#ifdef V4L2_PIX_FMT_BGR565
        _slots[i]->cap_fourcc = V4L2_PIX_FMT_BGR565;
#else
        _slots[i]->cap_fourcc = V4L2_PIX_FMT_RGB565;
#endif
        break;
      case DEV_ISP:
        _slots[i]->path = ESP32P4_V4L2_DEV_ISP;
        _slots[i]->cap_fourcc = V4L2_META_FMT_ESP_ISP_STATS;
        break;
      default:
        break;
    }
  }

  bool ok = false;
  if (_jpeg) {
    ok |= registerDev(DEV_JPEG_ENC);
    ok |= registerDev(DEV_JPEG_DEC);
    _fd_jpeg_enc = ::open(ESP32P4_V4L2_DEV_JPEG_ENC, O_RDWR);
    _fd_jpeg_dec = ::open(ESP32P4_V4L2_DEV_JPEG_DEC, O_RDWR);
  }
  if (_h264) {
    ok |= registerDev(DEV_H264_ENC);
    _fd_h264_enc = ::open(ESP32P4_V4L2_DEV_H264_ENC, O_RDWR);
  }
  if (_isp && _isp->ready()) {
    ok |= registerDev(DEV_ISP);
    _fd_isp = ::open(ESP32P4_V4L2_DEV_ISP, O_RDWR);
  }

  if (ok) {
    Serial.println("V4L2 M2M: video10=JPEG enc  video11=H264  video12=JPEG dec  video20=ISP stats");
  }
  return ok;
}

void ESP32P4_V4l2M2m::end() {
  if (_fd_jpeg_enc >= 0) {
    ::close(_fd_jpeg_enc);
    _fd_jpeg_enc = -1;
  }
  if (_fd_h264_enc >= 0) {
    ::close(_fd_h264_enc);
    _fd_h264_enc = -1;
  }
  if (_fd_jpeg_dec >= 0) {
    ::close(_fd_jpeg_dec);
    _fd_jpeg_dec = -1;
  }
  if (_fd_isp >= 0) {
    ::close(_fd_isp);
    _fd_isp = -1;
  }
  for (int i = 0; i < DEV_N; i++) {
    if (_slots[i]) {
      unregisterDev((DevKind)i);
      if (_slots[i]->scratch) free(_slots[i]->scratch);
      delete _slots[i];
      _slots[i] = nullptr;
    }
  }
  _cam = nullptr;
  _jpeg = nullptr;
  _h264 = nullptr;
  _isp = nullptr;
}

