TheZeroHz/ESP32CSI_Vision/src/v4l2/ESP32P4_V4l2M2m.cpp
bool ESP32P4_V4l2M2m::registerDev(DevKind k) {
  DevSlot *d = _slots[k];
  if (!d || d->registered) return d && d->registered;
  if (!d->path || d->path[0] != '/') return false;
  esp_vfs_t vfs = {};
  vfs.flags = ESP_VFS_FLAG_CONTEXT_PTR;
  vfs.open_p = ESP32P4_V4l2M2mVfs::open_p;
  vfs.close_p = ESP32P4_V4l2M2mVfs::close_p;
  vfs.read_p = ESP32P4_V4l2M2mVfs::read_p;
  vfs.write_p = ESP32P4_V4l2M2mVfs::write_p;
  vfs.ioctl_p = ESP32P4_V4l2M2mVfs::ioctl_p;
  vfs.fstat_p = ESP32P4_V4l2M2mVfs::fstat_p;
  if (esp_vfs_register(d->path, &vfs, d) != ESP_OK) return false;
  d->registered = true;
  return true;
}

void ESP32P4_V4l2M2m::unregisterDev(DevKind k) {
  DevSlot *d = _slots[k];
  if (!d || !d->registered) return;
  (void)esp_vfs_unregister(d->path);
  d->registered = false;
}

int ESP32P4_V4l2M2m::devOpen(DevKind k) {
  DevSlot *d = _slots[k];
  if (!d) return fail(ENODEV);
  if (d->open_n > 8) return fail(EMFILE);
  d->open_n++;
  return 0;
}

int ESP32P4_V4l2M2m::devClose(DevKind k) {
  DevSlot *d = _slots[k];
  if (!d) return fail(ENODEV);
  if (d->open_n) d->open_n--;
  d->out_streaming = d->cap_streaming = false;
  d->out_queued = d->cap_queued = d->cap_ready = false;
  return 0;
}

bool ESP32P4_V4l2M2m::fillIspStats(void *dst, size_t cap, size_t *out_len) {
  if (!dst || !out_len) return false;
#if __has_include("esp_video_isp_ioctl.h")
  if (cap < sizeof(esp_video_isp_stats_t)) return false;
  if (_isp && _isp->exportV4l2Stats((esp_video_isp_stats_t *)dst)) {
    *out_len = sizeof(esp_video_isp_stats_t);
    return true;
  }
  memset(dst, 0, sizeof(esp_video_isp_stats_t));
  auto *st = (esp_video_isp_stats_t *)dst;
  st->flags = ESP_VIDEO_ISP_STATS_FLAG_AE | ESP_VIDEO_ISP_STATS_FLAG_AWB;
  *out_len = sizeof(esp_video_isp_stats_t);
  return true;
#else
  return false;
#endif
}

bool ESP32P4_V4l2M2m::tryEncode(DevSlot *d) {
  if (!d || !d->out_queued || !d->cap_queued || !d->out_ptr || !d->cap_ptr) return false;
  if (!d->out_streaming || !d->cap_streaming) return false;

  size_t n = 0;
  switch (d->kind) {
    case DEV_JPEG_ENC: {
      if (!_jpeg) return false;
      esp32p4_cam_pixformat_t pix = ESP32P4_PIXFORMAT_RGB565;
      if (!pix_from_fourcc(d->out_fourcc, &pix)) return false;
      n = _jpeg->encode(d->out_ptr, d->out_w, d->out_h, pix, d->cap_ptr, d->cap_cap);
      break;
    }
    case DEV_H264_ENC: {
      if (!_h264 || !_h264->ready()) return false;
      esp32p4_cam_pixformat_t pix = ESP32P4_PIXFORMAT_RGB565;
      if (!pix_from_fourcc(d->out_fourcc, &pix)) return false;
      if (pix == ESP32P4_PIXFORMAT_RGB565) {
        n = _h264->encode(d->out_ptr, d->out_w, d->out_h, d->cap_ptr, d->cap_cap);
      } else {
        camera_fb_t fb = {};
        fb.buf = d->out_ptr;
        fb.width = d->out_w;
        fb.height = d->out_h;
        fb.format = pix;
        fb.len = d->out_len ? d->out_len : frame_bytes(d->out_fourcc, d->out_w, d->out_h);
        n = _h264->encode(&fb, d->cap_ptr, d->cap_cap);
      }
      break;
    }
    case DEV_JPEG_DEC: {
      if (!_jpeg) return false;
      uint32_t dw = 0, dh = 0;
      n = _jpeg->decode(d->out_ptr, d->out_len, d->cap_ptr, d->cap_cap, &dw, &dh);
      if (n) {
        d->cap_w = (uint16_t)dw;
        d->cap_h = (uint16_t)dh;
      }
      break;
    }
    default:
      return false;
  }
  if (!n) return false;
  d->cap_len = n;
  d->cap_ready = true;
  d->out_queued = false;
  return true;
}

ssize_t ESP32P4_V4l2M2m::devRead(DevKind k, void *dst, size_t n) {
  DevSlot *d = _slots[k];
  if (!d || !dst || !n) return fail(EINVAL);

  if (k == DEV_ISP) {
    size_t len = 0;
    if (!fillIspStats(dst, n, &len)) return fail(EAGAIN);
    return (ssize_t)len;
  }

  if (!d->cap_ready) {
    if (!tryEncode(d)) return fail(EAGAIN);
  }
  size_t copy = d->cap_len < n ? d->cap_len : n;
  if (d->cap_ptr != dst) memcpy(dst, d->cap_ptr, copy);
  d->cap_ready = false;
  d->cap_queued = false;
  return (ssize_t)copy;
}

ssize_t ESP32P4_V4l2M2m::devWrite(DevKind k, const void *src, size_t n) {
  DevSlot *d = _slots[k];
  if (!d || !src || !n) return fail(EINVAL);
  if (k == DEV_ISP) return fail(EINVAL);

  if (!d->scratch || d->scratch_cap < n) {
    uint8_t *p = (uint8_t *)realloc(d->scratch, n);
    if (!p) return fail(ENOMEM);
    d->scratch = p;
    d->scratch_cap = n;
  }
  memcpy(d->scratch, src, n);
  d->out_ptr = d->scratch;
  d->out_len = n;
  d->out_queued = true;

  if (!d->cap_ptr) {
    size_t cap_need = (k == DEV_JPEG_DEC) ? frame_bytes(d->cap_fourcc, d->out_w, d->out_h)
                                          : (d->cap_cap ? d->cap_cap : frame_bytes(d->cap_fourcc, d->cap_w, d->cap_h));
    if (cap_need < 64 * 1024) cap_need = 64 * 1024;
    if (!d->scratch_cap || d->scratch_cap < cap_need + n) {
      uint8_t *p = (uint8_t *)realloc(d->scratch, cap_need + n);
      if (!p) return fail(ENOMEM);
      d->scratch = p;
      d->scratch_cap = cap_need + n;
    }
    d->cap_ptr = d->scratch + n;
    d->cap_cap = cap_need;
  }
  d->cap_queued = true;
  d->out_streaming = d->cap_streaming = true;
  if (!tryEncode(d)) return (ssize_t)n;
  return (ssize_t)n;
}

int ESP32P4_V4l2M2m::devFstat(DevKind k, void *stv) {
  auto *st = (struct stat *)stv;
  if (!st) return fail(EINVAL);
  memset(st, 0, sizeof(*st));
  st->st_mode = S_IFCHR | 0666;
  (void)k;
  return 0;
}

int ESP32P4_V4l2M2m::devIoctl(DevKind k, unsigned long request, void *arg) {
  DevSlot *d = _slots[k];
  if (!d) return fail(ENODEV);

  if (request == VIDIOC_QUERYCAP) {
    auto *cap = (struct v4l2_capability *)arg;
    if (!cap) return fail(EINVAL);
    memset(cap, 0, sizeof(*cap));
    strncpy((char *)cap->driver, "csi_vision_m2m", sizeof(cap->driver) - 1);
    strncpy((char *)cap->card, dev_card(k), sizeof(cap->card) - 1);
    strncpy((char *)cap->bus_info, "platform", sizeof(cap->bus_info) - 1);
    cap->version = (3u << 16) | (18u << 8);
    if (k == DEV_ISP) {
      cap->capabilities = V4L2_CAP_META_CAPTURE | V4L2_CAP_STREAMING | V4L2_CAP_READWRITE |
                          V4L2_CAP_DEVICE_CAPS;
      cap->device_caps = V4L2_CAP_META_CAPTURE | V4L2_CAP_STREAMING | V4L2_CAP_READWRITE;
    } else {
      cap->capabilities = V4L2_CAP_VIDEO_M2M | V4L2_CAP_STREAMING | V4L2_CAP_READWRITE |
                          V4L2_CAP_DEVICE_CAPS;
      cap->device_caps = V4L2_CAP_VIDEO_M2M | V4L2_CAP_STREAMING | V4L2_CAP_READWRITE;
    }
    return 0;
  }

#ifdef VIDIOC_SET_OWNER
  if (request == VIDIOC_SET_OWNER) {
    d->owner_pid = arg ? *(int *)arg : 0;
    return 0;
  }
#endif

  if (request == VIDIOC_G_FMT || request == VIDIOC_TRY_FMT) {
    auto *fmt = (struct v4l2_format *)arg;
    if (!fmt) return fail(EINVAL);
    if (k == DEV_ISP) {
      if (fmt->type && fmt->type != V4L2_BUF_TYPE_META_CAPTURE) return fail(EINVAL);
      fmt->type = V4L2_BUF_TYPE_META_CAPTURE;
      fmt->fmt.meta.dataformat = V4L2_META_FMT_ESP_ISP_STATS;
#if __has_include("esp_video_isp_ioctl.h")
      fmt->fmt.meta.buffersize = sizeof(esp_video_isp_stats_t);
#else
      fmt->fmt.meta.buffersize = 512;
#endif
      return 0;
    }
    bool capture = (fmt->type == V4L2_BUF_TYPE_VIDEO_CAPTURE);
    if (fmt->type && fmt->type != V4L2_BUF_TYPE_VIDEO_OUTPUT &&
        fmt->type != V4L2_BUF_TYPE_VIDEO_CAPTURE)
      return fail(EINVAL);
    if (!fmt->type) fmt->type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
    auto &pix = fmt->fmt.pix;
    if (capture || fmt->type == V4L2_BUF_TYPE_VIDEO_CAPTURE) {
      pix.width = d->cap_w;
      pix.height = d->cap_h;
      pix.pixelformat = d->cap_fourcc;
      pix.sizeimage = (d->cap_fourcc == V4L2_PIX_FMT_JPEG || d->cap_fourcc == V4L2_PIX_FMT_H264)
                          ? (uint32_t)(d->cap_w * d->cap_h)
                          : (uint32_t)frame_bytes(d->cap_fourcc, d->cap_w, d->cap_h);
    } else {
      pix.width = d->out_w;
      pix.height = d->out_h;
      pix.pixelformat = d->out_fourcc;
      pix.sizeimage = (uint32_t)frame_bytes(d->out_fourcc, d->out_w, d->out_h);
    }
    pix.field = V4L2_FIELD_NONE;
    pix.bytesperline = pix.width * ((pix.pixelformat == V4L2_PIX_FMT_RGB565 ||
                                     pix.pixelformat == V4L2_PIX_FMT_BGR565)
                                        ? 2
                                        : 0);
    pix.colorspace = V4L2_COLORSPACE_SRGB;
    return 0;
  }

  if (request == VIDIOC_S_FMT) {
    auto *fmt = (struct v4l2_format *)arg;
    if (!fmt) return fail(EINVAL);
    if (k == DEV_ISP) return devIoctl(k, VIDIOC_G_FMT, arg);
    bool capture = (fmt->type == V4L2_BUF_TYPE_VIDEO_CAPTURE);
    auto &pix = fmt->fmt.pix;
    if (capture) {
      d->cap_w = pix.width ? pix.width : d->cap_w;
      d->cap_h = pix.height ? pix.height : d->cap_h;
      if (pix.pixelformat) d->cap_fourcc = pix.pixelformat;
    } else {
      d->out_w = pix.width ? pix.width : d->out_w;
      d->out_h = pix.height ? pix.height : d->out_h;
      if (pix.pixelformat) d->out_fourcc = pix.pixelformat;
    }
    return devIoctl(k, VIDIOC_G_FMT, arg);
  }

  if (request == VIDIOC_ENUM_FMT && is_m2m(k)) {
    auto *f = (struct v4l2_fmtdesc *)arg;
    if (!f) return fail(EINVAL);
    static const uint32_t kJpegIn[] = {V4L2_PIX_FMT_RGB565, V4L2_PIX_FMT_RGB24, V4L2_PIX_FMT_UYVY,
                                       V4L2_PIX_FMT_YUYV, V4L2_PIX_FMT_GREY, V4L2_PIX_FMT_YUV420};
    static const uint32_t kH264In[] = {V4L2_PIX_FMT_YUV420, V4L2_PIX_FMT_RGB565, V4L2_PIX_FMT_UYVY,
                                       V4L2_PIX_FMT_YUYV};
    const uint32_t *arr = nullptr;
    int arr_n = 0;
    if (k == DEV_JPEG_ENC && f->type == V4L2_BUF_TYPE_VIDEO_OUTPUT) {
      arr = kJpegIn;
      arr_n = (int)(sizeof(kJpegIn) / sizeof(kJpegIn[0]));
    } else if (k == DEV_JPEG_ENC && f->type == V4L2_BUF_TYPE_VIDEO_CAPTURE) {
      if (f->index != 0) return fail(EINVAL);
      f->flags = V4L2_FMT_FLAG_COMPRESSED;
      f->pixelformat = V4L2_PIX_FMT_JPEG;
      strncpy((char *)f->description, "JPEG", sizeof(f->description) - 1);
      return 0;
    } else if (k == DEV_H264_ENC && f->type == V4L2_BUF_TYPE_VIDEO_OUTPUT) {
      arr = kH264In;
      arr_n = (int)(sizeof(kH264In) / sizeof(kH264In[0]));
    } else if (k == DEV_H264_ENC && f->type == V4L2_BUF_TYPE_VIDEO_CAPTURE) {
      if (f->index != 0) return fail(EINVAL);
      f->flags = V4L2_FMT_FLAG_COMPRESSED;
      f->pixelformat = V4L2_PIX_FMT_H264;
      strncpy((char *)f->description, "H264", sizeof(f->description) - 1);
      return 0;
    } else if (k == DEV_JPEG_DEC && f->type == V4L2_BUF_TYPE_VIDEO_OUTPUT) {
      if (f->index != 0) return fail(EINVAL);
      f->flags = V4L2_FMT_FLAG_COMPRESSED;
      f->pixelformat = V4L2_PIX_FMT_JPEG;
      strncpy((char *)f->description, "JPEG", sizeof(f->description) - 1);
      return 0;
    } else if (k == DEV_JPEG_DEC && f->type == V4L2_BUF_TYPE_VIDEO_CAPTURE) {
      if (f->index > 1) return fail(EINVAL);
      f->pixelformat = (f->index == 0) ? V4L2_PIX_FMT_RGB565
#ifdef V4L2_PIX_FMT_BGR565
                                         : V4L2_PIX_FMT_BGR565;
#else
                                         : V4L2_PIX_FMT_RGB565;
#endif
      strncpy((char *)f->description, (f->index == 0) ? "RGB565" : "BGR565", sizeof(f->description) - 1);
      return 0;
    } else {
      return fail(EINVAL);
    }
    if ((int)f->index >= arr_n) return fail(EINVAL);
    f->pixelformat = arr[f->index];
    return 0;
  }

  if (request == VIDIOC_REQBUFS) {
    auto *r = (struct v4l2_requestbuffers *)arg;
    if (!r) return fail(EINVAL);
    if (r->count == 0) {
      d->out_queued = d->cap_queued = d->cap_ready = false;
      return 0;
    }
    r->count = r->count < 2 ? 2 : (r->count > 4 ? 4 : r->count);
    r->capabilities = V4L2_BUF_CAP_SUPPORTS_USERPTR | V4L2_BUF_CAP_SUPPORTS_MMAP;
    return 0;
  }

