TheZeroHz/ESP32CSI_Vision/src/v4l2/ESP32P4_V4l2M2m.cpp
  if (request == VIDIOC_QUERYBUF) {
    auto *b = (struct v4l2_buffer *)arg;
    if (!b || b->index > 3) return fail(EINVAL);
    uint32_t idx = b->index;
    bool capture = (b->type == V4L2_BUF_TYPE_VIDEO_CAPTURE) || (b->type == V4L2_BUF_TYPE_META_CAPTURE);
    memset(b, 0, sizeof(*b));
    b->index = idx;
    b->type = k == DEV_ISP ? V4L2_BUF_TYPE_META_CAPTURE
                           : (capture ? V4L2_BUF_TYPE_VIDEO_CAPTURE : V4L2_BUF_TYPE_VIDEO_OUTPUT);
    b->memory = V4L2_MEMORY_USERPTR;
    if (k == DEV_ISP) {
#if __has_include("esp_video_isp_ioctl.h")
      b->length = sizeof(esp_video_isp_stats_t);
#else
      b->length = 512;
#endif
    } else if (capture) {
      b->length = (d->cap_fourcc == V4L2_PIX_FMT_JPEG || d->cap_fourcc == V4L2_PIX_FMT_H264)
                      ? (uint32_t)(d->cap_w * d->cap_h)
                      : (uint32_t)frame_bytes(d->cap_fourcc, d->cap_w, d->cap_h);
    } else {
      b->length = (uint32_t)frame_bytes(d->out_fourcc, d->out_w, d->out_h);
    }
    b->m.offset = b->index * 4096u;
    b->flags = V4L2_BUF_FLAG_MAPPED;
    return 0;
  }

  if (request == VIDIOC_QBUF) {
    auto *b = (struct v4l2_buffer *)arg;
    if (!b) return fail(EINVAL);
    bool capture = (b->type == V4L2_BUF_TYPE_VIDEO_CAPTURE) || (b->type == V4L2_BUF_TYPE_META_CAPTURE);
    if (capture) {
      d->cap_ptr = (uint8_t *)(uintptr_t)b->m.userptr;
      d->cap_cap = b->length;
      d->cap_queued = true;
      if (k == DEV_ISP && d->cap_ptr) {
        size_t len = 0;
        if (fillIspStats(d->cap_ptr, d->cap_cap, &len)) {
          b->bytesused = (uint32_t)len;
          b->flags = V4L2_BUF_FLAG_DONE | V4L2_BUF_FLAG_TIMESTAMP_MONOTONIC;
          b->sequence = d->seq++;
          d->cap_ready = true;
        }
      } else {
        (void)tryEncode(d);
      }
    } else {
      d->out_ptr = (uint8_t *)(uintptr_t)b->m.userptr;
      d->out_len = b->bytesused ? b->bytesused : b->length;
      d->out_queued = true;
      (void)tryEncode(d);
    }
    b->flags = V4L2_BUF_FLAG_QUEUED;
    return 0;
  }

  if (request == VIDIOC_DQBUF) {
    auto *b = (struct v4l2_buffer *)arg;
    if (!b) return fail(EINVAL);
    bool capture = (b->type == V4L2_BUF_TYPE_VIDEO_CAPTURE) || (b->type == V4L2_BUF_TYPE_META_CAPTURE);
    if (capture) {
      if (!d->cap_ready) {
        if (!tryEncode(d)) return fail(EAGAIN);
      }
      memset(b, 0, sizeof(*b));
      b->type = k == DEV_ISP ? V4L2_BUF_TYPE_META_CAPTURE : V4L2_BUF_TYPE_VIDEO_CAPTURE;
      b->memory = V4L2_MEMORY_USERPTR;
      b->m.userptr = (unsigned long)d->cap_ptr;
      b->bytesused = (uint32_t)d->cap_len;
      b->length = (uint32_t)d->cap_cap;
      b->flags = V4L2_BUF_FLAG_DONE | V4L2_BUF_FLAG_TIMESTAMP_MONOTONIC;
      b->sequence = d->seq++;
      d->cap_ready = false;
      d->cap_queued = false;
      return 0;
    }
    if (!d->out_queued) return fail(EAGAIN);
    memset(b, 0, sizeof(*b));
    b->type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
    b->memory = V4L2_MEMORY_USERPTR;
    b->m.userptr = (unsigned long)d->out_ptr;
    b->bytesused = (uint32_t)d->out_len;
    b->length = (uint32_t)d->out_len;
    b->flags = V4L2_BUF_FLAG_DONE;
    b->sequence = d->seq++;
    d->out_queued = false;
    return 0;
  }

  if (request == VIDIOC_STREAMON) {
    auto *t = (enum v4l2_buf_type *)arg;
    if (!t) return fail(EINVAL);
    if (*t == V4L2_BUF_TYPE_VIDEO_OUTPUT) d->out_streaming = true;
    else if (*t == V4L2_BUF_TYPE_VIDEO_CAPTURE || *t == V4L2_BUF_TYPE_META_CAPTURE)
      d->cap_streaming = true;
    (void)tryEncode(d);
    return 0;
  }

  if (request == VIDIOC_STREAMOFF) {
    auto *t = (enum v4l2_buf_type *)arg;
    if (!t) return fail(EINVAL);
    if (*t == V4L2_BUF_TYPE_VIDEO_OUTPUT) d->out_streaming = false;
    else if (*t == V4L2_BUF_TYPE_VIDEO_CAPTURE || *t == V4L2_BUF_TYPE_META_CAPTURE)
      d->cap_streaming = false;
    d->out_queued = d->cap_queued = d->cap_ready = false;
    return 0;
  }

  if (request == VIDIOC_G_EXT_CTRLS || request == VIDIOC_S_EXT_CTRLS ||
      request == VIDIOC_TRY_EXT_CTRLS) {
#if __has_include("esp_video_isp_ioctl.h")
    auto *cs = (struct v4l2_ext_controls *)arg;
    if (!cs || !cs->controls) return fail(EINVAL);
    if (k != DEV_ISP || !_isp) return fail(EINVAL);
    for (uint32_t i = 0; i < cs->count; i++) {
      cs->error_idx = i;
      auto &c = cs->controls[i];
      void *ptr = c.ptr ? c.ptr : (void *)c.p_u8;
      if (!ptr || !c.size) return fail(EINVAL);
      if (request == VIDIOC_G_EXT_CTRLS) {
        if (!_isp->exportV4l2Cid(c.id, ptr, c.size)) return fail(EINVAL);
      } else if (request != VIDIOC_TRY_EXT_CTRLS) {
        if (!_isp->importV4l2Cid(c.id, ptr, c.size)) return fail(EINVAL);
      }
    }
    cs->error_idx = cs->count;
    return 0;
#else
    return fail(ENOTTY);
#endif
  }

  if (request == VIDIOC_G_CTRL || request == VIDIOC_S_CTRL) {
    auto *c = (struct v4l2_control *)arg;
    if (!c) return fail(EINVAL);
    if (k == DEV_JPEG_ENC && _jpeg) {
      if (c->id == V4L2_CID_JPEG_COMPRESSION_QUALITY) {
        if (request == VIDIOC_S_CTRL) _jpeg->setQuality((uint8_t)c->value);
        else c->value = _jpeg->quality();
        return 0;
      }
      if (c->id == V4L2_CID_JPEG_CHROMA_SUBSAMPLING) {
        if (request == VIDIOC_S_CTRL) {
          esp32p4_jpeg_chroma_t ch = ESP32P4_JPEG_CHROMA_AUTO;
          switch (c->value) {
            case V4L2_JPEG_CHROMA_SUBSAMPLING_444:
              ch = ESP32P4_JPEG_CHROMA_YUV444;
              break;
            case V4L2_JPEG_CHROMA_SUBSAMPLING_422:
              ch = ESP32P4_JPEG_CHROMA_YUV422;
              break;
            case V4L2_JPEG_CHROMA_SUBSAMPLING_420:
              ch = ESP32P4_JPEG_CHROMA_YUV420;
              break;
            default:
              break;
          }
          _jpeg->setChroma(ch);
        } else {
          switch (_jpeg->chroma()) {
            case ESP32P4_JPEG_CHROMA_YUV444:
              c->value = V4L2_JPEG_CHROMA_SUBSAMPLING_444;
              break;
            case ESP32P4_JPEG_CHROMA_YUV422:
              c->value = V4L2_JPEG_CHROMA_SUBSAMPLING_422;
              break;
            case ESP32P4_JPEG_CHROMA_YUV420:
              c->value = V4L2_JPEG_CHROMA_SUBSAMPLING_420;
              break;
            default:
              c->value = V4L2_JPEG_CHROMA_SUBSAMPLING_422;
              break;
          }
        }
        return 0;
      }
    }
    if (k == DEV_H264_ENC && _h264 && _h264->ready()) {
      switch (c->id) {
        case V4L2_CID_MPEG_VIDEO_BITRATE:
          if (request == VIDIOC_S_CTRL) return _h264->setBitrate((uint32_t)c->value) ? 0 : fail(EINVAL);
          c->value = (int32_t)_h264->bitrate();
          return 0;
        case V4L2_CID_MPEG_VIDEO_GOP_SIZE:
          if (request == VIDIOC_S_CTRL) return _h264->setGop((uint8_t)c->value) ? 0 : fail(EINVAL);
          c->value = _h264->gop();
          return 0;
        case V4L2_CID_MPEG_VIDEO_H264_I_PERIOD:
          if (request == VIDIOC_S_CTRL) return _h264->setGop((uint8_t)c->value) ? 0 : fail(EINVAL);
          c->value = _h264->gop();
          return 0;
        case V4L2_CID_MPEG_VIDEO_H264_MIN_QP:
          if (request == VIDIOC_G_CTRL) {
            c->value = 20;
            return 0;
          }
          return 0;
        case V4L2_CID_MPEG_VIDEO_H264_MAX_QP:
          if (request == VIDIOC_G_CTRL) {
            c->value = 45;
            return 0;
          }
          return 0;
        case V4L2_CID_MPEG_VIDEO_FORCE_KEY_FRAME:
          if (request == VIDIOC_S_CTRL) return _h264->forceIdr() ? 0 : fail(EINVAL);
          c->value = 0;
          return 0;
        default:
          break;
      }
    }
    return fail(EINVAL);
  }

