TheZeroHz/ESP32CSI_Vision/src/v4l2/ESP32P4_V4l2M2m.cpp
  if (request == VIDIOC_QUERYCTRL && k == DEV_JPEG_ENC) {
    auto *qc = (struct v4l2_queryctrl *)arg;
    if (!qc) return fail(EINVAL);
    if (qc->id == V4L2_CID_JPEG_COMPRESSION_QUALITY || qc->id == V4L2_CID_JPEG_CHROMA_SUBSAMPLING ||
        (qc->id & V4L2_CTRL_FLAG_NEXT_CTRL)) {
      memset(qc, 0, sizeof(*qc));
      if (qc->id == V4L2_CID_JPEG_CHROMA_SUBSAMPLING ||
          (qc->id & V4L2_CTRL_FLAG_NEXT_CTRL && qc->id < V4L2_CID_JPEG_CHROMA_SUBSAMPLING)) {
        qc->id = V4L2_CID_JPEG_CHROMA_SUBSAMPLING;
        qc->type = V4L2_CTRL_TYPE_MENU;
        strncpy((char *)qc->name, "Chroma Subsampling", sizeof(qc->name) - 1);
        qc->minimum = V4L2_JPEG_CHROMA_SUBSAMPLING_444;
        qc->maximum = V4L2_JPEG_CHROMA_SUBSAMPLING_420;
        return 0;
      }
      qc->id = V4L2_CID_JPEG_COMPRESSION_QUALITY;
      qc->type = V4L2_CTRL_TYPE_INTEGER;
      strncpy((char *)qc->name, "Compression Quality", sizeof(qc->name) - 1);
      qc->minimum = 1;
      qc->maximum = 100;
      qc->step = 1;
      qc->default_value = 45;
      return 0;
    }
  }

  return fail(ENOTTY);
}

#else  // !ESP32P4_V4L2M2M_HAS_V4L2

bool ESP32P4_V4l2M2m::begin(const Config &) { return false; }
void ESP32P4_V4l2M2m::end() {}
bool ESP32P4_V4l2M2m::registerDev(DevKind) { return false; }
void ESP32P4_V4l2M2m::unregisterDev(DevKind) {}
int ESP32P4_V4l2M2m::devOpen(DevKind) { return -1; }
int ESP32P4_V4l2M2m::devClose(DevKind) { return -1; }
ssize_t ESP32P4_V4l2M2m::devRead(DevKind, void *, size_t) { return -1; }
ssize_t ESP32P4_V4l2M2m::devWrite(DevKind, const void *, size_t) { return -1; }
int ESP32P4_V4l2M2m::devFstat(DevKind, void *) { return -1; }
int ESP32P4_V4l2M2m::devIoctl(DevKind, unsigned long, void *) { return -1; }
bool ESP32P4_V4l2M2m::tryEncode(DevSlot *) { return false; }
bool ESP32P4_V4l2M2m::fillIspStats(void *, size_t, size_t *) { return false; }

#endif
